Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler
The Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler class handles numeric input events
following the event identified by Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputRequested.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.callback
The callback method for the completion event, handled by Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.OnNumericInputCompleted(System.String).

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.IsStarted
Gets a value indicating whether the numeric input has been started.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.IsEnding
Gets a value indicating whether the numeric input is ending.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.Register(System.Func{Tekla.BIM.DirectManipulation.Services.Interaction.NumericInputCompletedEventArgs,System.Boolean})
Registers onInputCompletedCallback so that it will be called once when the numeric input is completed.
onInputCompletedCallback: The callback method for the numeric input completion event.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.DotExportNumericInputRequestConsumed(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Notifies when the numeric input will be handled.
requestConsumed: True on consumed; otherwise, false.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.DotExportNumericInputConsumed(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Notifies when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputCompleted event has been consumed.
requestConsumed: True on consumed; otherwise, false.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.DotExportGetNumericInputValues(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData@)
Gets the inputted string from TS core when the Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.OnNumericInputCompleted(System.String) event occurs.
inputValue: The inputted string.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.ConvertToNumericInputCompletedEventArgs(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData)
Converts the given Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData value to a Tekla.BIM.DirectManipulation.Services.Interaction.NumericInputCompletedEventArgs instance.
dotData: The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData value to convert.
Returns: A Tekla.BIM.DirectManipulation.Services.Interaction.NumericInputCompletedEventArgs instance.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler.OnNumericInputCompleted(System.String)
Handles the input completion event.
param: Expected to equal either Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputCompleted or Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputCanceled.